In [ ]:
from pyspark.sql import SparkSession

spark = SparkSession.builder \
      .appName("Read CSV Example") \
      .getOrCreate()

CSV

In [ ]:
data = """id,name,city,age,salary
1,Arjun,Hyderabad,25,45000
2,Meera,Chennai,32,52000
3,Rajesh,Bangalore,29,61000
4,Priya,Delhi,22,38000
5,Sanjay,Mumbai,35,72000
"""

with open("employees.csv","w") as f:
  f.write(data)

In [ ]:
df=spark.read \
   .option("header",True) \
   .option("interSchema",True) \
   .csv('employees.csv')
df.show()
df.printSchema()

+---+------+---------+---+------+
| id|  name|     city|age|salary|
+---+------+---------+---+------+
|  1| Arjun|Hyderabad| 25| 45000|
|  2| Meera|  Chennai| 32| 52000|
|  3|Rajesh|Bangalore| 29| 61000|
|  4| Priya|    Delhi| 22| 38000|
|  5|Sanjay|   Mumbai| 35| 72000|
+---+------+---------+---+------+

root
 |-- id: string (nullable = true)
 |-- name: string (nullable = true)
 |-- city: string (nullable = true)
 |-- age: string (nullable = true)
 |-- salary: string (nullable = true)

Json

In [ ]:
json_data = [
    {"id": 1, "name": "Arjun", "dept": "IT", "salary": 50000},
    {"id": 2, "name": "Meera", "dept": "HR", "salary": 45000},
    {"id": 3, "name": "Rajesh", "dept": "Finance", "salary": 60000}
]

df_json = spark.createDataFrame(json_data)
df_json.write.mode("overwrite").json("employees.json")

In [ ]:
df = spark.read.json("employees.json")
df.show()
df.printSchema()

+-------+---+------+------+
|   dept| id|  name|salary|
+-------+---+------+------+
|     HR|  2| Meera| 45000|
|Finance|  3|Rajesh| 60000|
|     IT|  1| Arjun| 50000|
+-------+---+------+------+

root
 |-- dept: string (nullable = true)
 |-- id: long (nullable = true)
 |-- name: string (nullable = true)
 |-- salary: long (nullable = true)

Parquet

In [ ]:
df.write.mode("overwrite").parquet("employees.parquet")

In [ ]:
df_parquet = spark.read.parquet("employees.parquet")
df_parquet.show()

+-------+---+------+------+
|   dept| id|  name|salary|
+-------+---+------+------+
|     HR|  2| Meera| 45000|
|Finance|  3|Rajesh| 60000|
|     IT|  1| Arjun| 50000|
+-------+---+------+------+